#coding=utf8
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]

xyz = zip(x, y, z)
u = zip(*xyz)
'''
在运行zip(*xyz)之前，xyz的值是：[(1, 4, 7), (2, 5, 8), (3, 6, 9)]
那么，zip(*xyz) 等价于 zip((1, 4, 7), (2, 5, 8), (3, 6, 9))
所以，运行结果是：[(1, 2, 3), (4, 5, 6), (7, 8, 9)]
'''
print u
print '\n----------------------\n'


x = [1, 2, 3]
r = zip(* [x] * 3)

'''
[x]生成一个列表的列表，它只有一个元素x
[x] * 3生成一个列表的列表，它有3个元素，[x, x, x]
zip(* [x] * 3)的意思就明确了，zip(x, x, x)
'''
print r
print '\n----------------------\n'




a = [1, 2, 3, 4, 5, 6]
print zip(*([a] * 2))
print zip(*([iter(a)] * 2))
'''
迭代器不是列表另一种形式
'''












